[
    {
        "title": "Lamb Shank Tagine",
        "author": "Elizabeth Reed",
        "serves": 4,
        "cookingTimeHrs": 3,
        "cookingTimeMins": 30,
        "image": "/images/lamb-tagine.jpg",
        "difficulty": "Medium",
        "likes": 175,
        "tags": "Dinner|Main|Fancy",
        "ingredients": "4 lamb shanks, French trimmed|olive oil|1 fresh red chilli|1 clove of garlic|1 red onion|1 quince|2 carrots|1 bulb of fennel|2 fresh bay leaves|1 pinch of saffron|2 ripe tomatoes , on the vine|1 preserved lemon|1 litre quality organic chicken stock|200 g couscous|1 bunch of fresh mint , (30g)|1 handful of black olives , (stone in)|½ a bunch of fresh flat-leaf parsley , (15g)|½ a lemon|½ an orange|extra virgin olive oil|50 g rose harissa|4 heaped tablespoons fat-free natural yoghurt|RAS EL-HANOUT|2 cardamon pods|½ teaspoon ground cinnamon|1 teaspoon cayenne pepper|1 heaped teaspoon coriander seeds|½ teaspoon sweet smoked paprika|1 tiny pinch of cumin seeds|½ teaspoon ground turmeric|½ teaspoon ground ginger",
        "method": "Preheat the oven to 160ºC/325ºF/gas 3.|To make the ras el hanout, lightly bash the cardamom pods in a pestle and mortar, then shake out the seeds, discarding the pods. Bash and muddle in the remaining ingredients to form a powder.|Massage into the lamb shanks, then place in a large ovenproof pan on a medium-high heat with ½ a tablespoon of olive oil. Cook for 6 to 8 minutes, or until browned all over, turning regularly.|Prick the chilli and add alongside the lamb until slightly scalded all over, then remove both lamb and chilli to a plate.|Peel and finely slice the garlic. Peel the onion and quince, cutting each into 8 wedges. Peel the carrots and chop at an angle into 4cm chunks. Trim and quarter the fennel bulb.|Wipe out the pan with a ball of kitchen paper, then place on a medium heat with ½ a tablespoon of olive oil, the pricked chilli, bay leaves, garlic, quince and veg. Cook for 10 to 12 minutes, or until softened, stirring occasionally.|In a cup, just cover the saffron with boiling water.|Return the lamb shanks to the pan, then quarter and add the tomatoes along with the saffron mixture, whole preserved lemon and stock. Bring to the boil. Cover the surface with a scrunched-up circular sheet of wet greaseproof paper, then pop a lid on.|Cook in the oven for 2 hours to 2 hours 30 minutes, or until the shanks are soft and delicious and the sauce has reduced.|Use a spoon to skim away any excess fat from the surface, then carefully remove the shanks to a plate.|Place the pan on a medium-high heat for 5 to 10 minutes, or until the sauce has thickened and reduced, stirring occasionally.|Place the couscous and half the mint sprigs in a bowl, just cover with boiling water, pop a plate on top and leave to soak and infuse.|To make a salad, destone the olives and roughly tear into a bowl. Pick in the parsley and remaining mint leaves, squeeze over the lemon and orange juice, add a drizzle of extra virgin olive oil and a pinch of sea salt and black pepper, then toss together.|Swirl the harissa through the yoghurt. Return the lamb shanks to the sauce.|Fluff up the couscous, discarding the mint, then divide between your plates. Spoon over the tagine, sprinkle over the salad, and finish with a dollop of harissa yoghurt."
    },
    {
        "title": "Roast Pork Belly",
        "author": "Noah Newton",
        "serves": 8,
        "cookingTimeHrs": 4,
        "cookingTimeMins": 0,
        "image": "/images/pork-belly.jpg",
        "difficulty": "Easy",
        "tags": "Dinner|Comfort Food",
        "likes": 291,
        "ingredients": "4 kg piece of higher-welfare pork belly, bone in|6 bay leaves|2 tablespoons sea salt|2 tablespoons coriander seeds|2 tablespoons fennel seeds|2 tablespoons black peppercorns|4 onions|300 ml dry cider|3 tablespoons plain flour|4 carrots|4 potatoes|4 sticks of celery|2 bulbs of fennel|4 sprigs of fresh rosemary|1 bulb of garlic",
        "method": "Leave the pork uncovered in the fridge overnight to dry out the skin.|Preheat the oven to full whack (240°C/475°F/gas 9).|Carefully score the pork skin with a sharp knife or scalpel.|Place the bay leaves in a pestle and mortar with the sea salt and give it a good bashing. Add the coriander seeds, fennel seeds and peppercorns, then bash again until fine.|Rub 2 tablespoons of the flavoured salt all over the pork, massaging it into all the nooks and crannies, saving the rest for another day. Brush away any excess.|Clank up the onions into wedges and arrange them skin-side up in rows. Lay the pork directly over the onions, then roast for 40 to 50 minutes, or until the crackling is golden and super crunchy.|Meanwhile, prepare the veg. Scrub the carrots and potatoes, trim the celery and fennel, then clank up into 2½cm chunks and place on a large baking tray. Pick over the rosemary leaves, then break up the garlic bulb and scatter over the cloves, leaving the skin on. Season with salt and pepper, then give it a good mix.|Remove the pork from the oven and reduce the temperature to 150°C/300°F/gas 2.|Using tongs, carefully lift the pork off the onions and place it directly on the top bars of the oven. Position the tray of veg exactly underneath to catch the tasty juices. Cook the pork for a further 2 to 4 hours – after 2 hours, the meat will be soft and easy to carve, after 4 hours, the meat will be soft enough to ‘pull’. Toss the veg occasionally, turning to coat in the pork juices until caramelised and cooked to your liking, then remove. (Pop an empty tray under the pork to prevent the juices from making a mess in your oven.)|To make the gravy, carefully drain the fat from the onions and reserve for another day. Place the tray on the hob over a medium heat, then pour in the cider and let it bubble away for a few minutes, scraping up all the sticky goodness from the base of the tray.|Gradually stir in the flour, then pour in 1.5 litres of boiling water and stir on the heat for 15 minutes, or until thickened and reduced.|When it’s time to dish up, arrange the veg on a serving platter with the pork and strain the gravy into a jug. Carve or pull the pork and plate it up with a little bit of everything. Delicious served with a simple watercress and apple salad, and a dollop of English mustard."
    },
    {
        "title": "Thai Green Chicken Curry",
        "author": "Mike Morales",
        "serves": 6,
        "cookingTimeHrs": 0,
        "cookingTimeMins": 45,
        "image": "/images/green-curry.jpg",
        "difficulty": "Easy",
        "likes": 386,
        "tags": "Dinner|Main|Spicy",
        "ingredients": "750g skinless free-range chicken thighs|groundnut oil|400 g mixed oriental mushrooms|1 x 400g tin of light coconut milk|1 organic chicken stock cube|6 lime leaves|200 g mangetout|½ a bunch fresh Thai basil|2 limes|CURRY PASTE|4 cloves of garlic|2 shallots|5cm piece of ginger|2 lemongrass stalks|4 green Bird’s eye chillies|1 teaspoon ground cumin|½ a bunch of fresh coriander|2 tablespoons fish sauce",
        "method": "To make the curry paste, peel, roughly chop and place the garlic, shallots and ginger into a food processor.|Trim the lemongrass, remove the tough outer leaves, then finely chop and add to the processor. Trim and add the chillies along with the cumin and half the coriander (stalks and all). Blitz until finely chopped, add the fish sauce and blitz again.|Slice the chicken into 2.5cm strips. Heat 1 tablespoon of oil in a large pan on a medium heat, add the chicken and fry for 5 to 7 minutes, or until just turning golden, then transfer to a plate.|Tear the mushrooms into even pieces. Return the pan to a medium heat, add the mushrooms and fry for 4 to 5 minutes, or until golden. Transfer to a plate using a slotted spoon.|Reduce the heat to medium-low and add the Thai green paste for 4 to 5 minutes, stirring occasionally.|Pour in the coconut milk and 200ml of boiling water, crumble in the stock cube and add the lime leaves. Turn the heat up and bring gently to the boil, then simmer for 10 minutes, or until reduced slightly.|Stir in the chicken and mushrooms, reduce the heat to low and cook for a further 5 minutes, or until the chicken is cooked through, adding the mangetout for the final 2 minutes.|Season carefully to taste with sea salt and freshly ground black pepper. Pick, roughly chop and stir through the basil leaves and remaining coriander leaves. Serve with lime wedges and steamed rice."
    },
    {
        "title": "Paella",
        "author": "Alex Mccoy",
        "serves": 6,
        "cookingTimeHrs": 1,
        "cookingTimeMins": 30,
        "image": "/images/paella.jpg",
        "difficulty": "Medium",
        "likes": 96,
        "tags": "Seafood|Dinner|Main|Gluten-free",
        "ingredients": "6 free-range chicken thighs, skin on, bone in|plain flour|olive oil|100 g quality chorizo|1 onion|4 cloves of garlic|½ a bunch of fresh flat-leaf parsley|6 rashers of higher-welfare pancetta or smoked streaky bacon|2 litres organic chicken stock|2 large pinches of saffron|1 heaped teaspoon smoked paprika|500 g paella rice|2 small squid , from sustainable sources, optional|2 handfuls of fresh or frozen peas|10 large raw shell-on king prawns , from sustainable sources|500 g mussels , (cleaned) from sustainable sources, optional|1 lemon",
        "method": "Preheat the oven to 190ºC/375ºF/gas 5.|Quarter each piece of chicken, then season with sea salt and black pepper and dust with flour.|Heat a splash of oil in a large, deep pan on a medium heat and fry the chicken until golden brown all over, then transfer to a baking tray and place in the oven for 20 minutes, or until cooked through.|Meanwhile, slice the chorizo, peel and finely chop the onion and garlic, and pick and finely chop the parsley leaves, finely chopping the stalks.|Put the pan back on the heat, add the sliced chorizo and pancetta or bacon and fry until browned and crispy. Add the onion, garlic and parsley stalks, then cook until soft.|Meanwhile, gently heat the chicken stock and infuse half with the saffron.|Add the smoked paprika, the rice and infused stock to the pan and leave to cook on a medium heat for around 20 minutes, stirring occasionally.|Meanwhile, halve the squid and lightly score all over with a regular eating knife (if using).|When the time’s up, add the remaining stock, peas, prawns, and the mussels and squid (if using). Place a lid on the pan and cook for 10 further minutes.|Finally, add the cooked chicken, sprinkle over the chopped parsley and serve with wedges of lemon for squeezing over."
    },
    { 
        "title": "Perfect Roast Chicken",
        "author": "Tara Gordon", 
        "serves": "4", 
        "cookingTimeHrs": 1,
        "cookingTimeMins": 20,
        "image": "/images/roast-chicken.jpg", 
        "difficulty": "Easy", 
        "ingredients": "1 x 1.6 kg chicken|2 medium onions|2 carrots|2 sticks of celery|1 bulb of garlic|olive oil|1 lemon|1 bunch of mixed fresh herbs", 
        "method": "Remove the chicken from the fridge 30 minutes before you want to cook it, to let it come up to room temperature.|Preheat the oven to 240°C/475°F/gas 9.|Wash and roughly chop the vegetables – there’s no need to peel them. Break the garlic bulb into cloves, leaving them unpeeled.|Pile all the veg, garlic and herbs into the middle of a large roasting tray and drizzle with oil.|Drizzle the chicken with oil and season well with sea salt and black pepper, then rub all over the bird. Place the chicken on top of the vegetables.|Carefully prick the lemon all over, using the tip of a sharp knife (if you have a microwave, you could pop the lemon in these for 40 seconds at this point as this will really bring out the flavour). Put the lemon inside the chicken’s cavity, with the bunch of herbs.|Place the tray in the oven, then turn the heat down immediately to 200°C/400°F/gas 6 and cook for 1 hour 20 minutes.|If you’re doing roast potatoes and veggies, this is the time to crack on with them – get them into the oven for the last 45 minutes of cooking.|Baste the chicken halfway through cooking and if the veg look dry, add a splash of water to the tray to stop them from burning.|When the chicken is cooked, take the tray out of the oven and transfer the chicken to a board to rest for 15 minutes or so. Cover it with a layer of tin foil and a tea towel and leave aside while you make your gravy.|To carve your chicken, remove any string and take off the wings (break them up and add to your gravy, along with the veg trivet, for mega flavour). Carefully cut down between the leg and the breast. Cut through the joint and pull the leg off.|Repeat on the other side, then cut each leg between the thigh and the drumstick so you end up with four portions of dark meat. Place these on a serving platter.|You should now have a clear space to carve the rest of your chicken. Angle the knife along the breastbone and carve one side off, then the other.|When you get down to the fussy bits, just use your fingers to pull all the meat off, and turn the chicken over to get all the tasty, juicy bits from underneath. You should be left with a stripped carcass, and a platter full of lovely meat that you can serve with your piping hot gravy and some delicious roast veg.", 
        "tags": "Family|Dinner|Main|Gluten-free",
        "likes": "67" 
    },
    { 
        "title": "Garlic & Chilli Prawns",
        "author": "Felicia Parker", 
        "serves": "2", 
        "cookingTimeHrs": 0,
        "cookingTimeMins": 15,
        "image": "/images/garlic-prawns.jpg", 
        "difficulty": "Very Easy", 
        "ingredients": "8 large raw shell-on king prawns , from sustainable sources|3 cloves of garlic|1 fresh red chilli|a few sprigs of fresh flat-leaf parsley|50 ml olive oil , ideally Spanish|½ teaspoon smoked paprika|1 lemon", 
        "method": "Peel the prawns, removing the heads and leaving the tails on. Run the tip of a knife down the backs of the peeled prawns and pull out and discard the dark vein.|Peel the garlic and finely chop with the chilli (deseed if you like). Pick and finely chop the parsley leaves.|Drizzle the oil into a shallow heatproof terracotta dish or a small frying pan over a medium-high heat, add the garlic and chilli and fry for 30 seconds to flavour the oil, before stirring in the paprika.|Add the prawns and fry for 2 minutes on each side, or until cooked through, adding most of the parsley when you turn the prawns.|Squeeze half the lemon juice into the dish, then remove from the heat and sprinkle over the remaining parsley and a pinch of sea salt.|Serve sizzling with warm crusty bread, the remaining lemon cut wedges for squeezing over, and a glass of good Spanish wine.", 
        "tags": "Entree|Seafood|Gluten-free|Spicy",
        "likes": "45" 
    },
    { 
        "title": "Classic Family Lasagne",
        "author": "Felicia Parker", 
        "serves": "10", 
        "cookingTimeHrs": 4,
        "cookingTimeMins": 30,
        "image": "/images/lasagne.jpg", 
        "difficulty": "Medium", 
        "ingredients": "2 sprigs of fresh rosemary|100 g higher-welfare smoked streaky bacon|olive oil|1 kg quality minced beef|1 kg higher-welfare minced pork|4 carrots|2 onions|4 sticks of celery|2 heaped tablespoons tomato purée|4 x 400 g tins of plum tomatoes|350 g dried lasagne sheets|WHITE SAUCE|150 g mature Cheddar cheese|2 medium leeks|2 fresh bay leaves|4 tablespoons plain flour|1 litre semi-skimmed milk|1 whole nutmeg , for grating", 
        "method": "Strip and finely chop the rosemary leaves and finely chop the bacon.|Heat 1 tablespoon of oil in a large casserole pan on a high heat. Once hot, add the rosemary and bacon and fry for 2 minutes, or until the bacon starts to crisp up, stirring regularly.|Add all the minced meat, using a wooden spoon to break it up as you go. Reduce the heat to medium and cook for at least 10 minutes, or until all the liquid has evaporated, stirring occasionally.|Place the coarse grater attachment in your food processor (or you could use a box grater instead) and grate the Cheddar, then tip into a bowl.|Replace the grater with the regular blade. Trim and halve the carrots, then add to the processor and blitz to roughly the same size as the mince. Peel and halve the onions, add them to the carrot and blitz again.|Tip into the pan with the mince while you get on with blitzing and adding the celery. Cook for 15 to 20 minutes, or until the vegetables start to soften, stirring regularly.|Next, add the tomato purée and plum tomatoes, breaking them up with a spoon. Fill each of the tins with water and tip into the pan.| Give everything a good stir and reduce the heat to low. Leave to simmer around 2 hours, or until thickened and reduced, stirring occasionally.|While that ticks away, make your white sauce. Trim, wash and finely slice the leeks, then add to a pan along with 2 tablespoons of oil and the bay leaves. Stir well and season with a tiny pinch of sea salt and black pepper.|Reduce the heat to low and cook for 30 minutes, or until sweet and softened, adding splashes of water, if needed.|Add the flour and stir well to coat, then gradually add the milk, stirring continuously. Turn the heat up to medium, bring to the boil, then reduce to low and cook for 5 to 10 minutes, or until thickened, stirring regularly.|Carefully transfer the sauce to the food processor and blitz until smooth and silky. Add half the grated cheese and finely grate over half the nutmeg and mix well. Season to taste.|Once the ragù is ready, preheat the oven to 190ºC/375ºF/gas 5.|Season the ragù to taste, then transfer half into freezer bags, portioning up as appropriate for your family. Allow to cool to room temperature, then pop in the freezer for another day. It’s a good idea to freeze them flat so that you can reheat them quickly and easily. It’s also a good idea to label and date them to avoid a game of freezer roulette in a few weeks’ time!|To build your lasagne, spoon a quarter of the ragù into a large deep ovenproof dish (roughly 25cm by 30cm) and spread it out evenly.|Spoon over a quarter of the white sauce, then snap over some lasagne sheets, making sure they completely cover the sauce in one layer. Repeat this 3 times, finishing with a layer of white sauce.|Sprinkle over the remaining cheese and bake the lasagne in the oven for 45 minutes or until golden and bubbling.|Remove the lasagne from the oven and leave to sit for 5 to 10 minutes before serving. Delicious served with a fresh green salad.", 
        "tags": "Family|Dinner|Main|Comfort Food|Classic",
        "likes": "121" 
    },
    { 
        "title": "Spaghetti Bolognese",
        "author": "Timothea Reynolds", 
        "serves": "6", 
        "cookingTimeHrs": 1,
        "cookingTimeMins": 15,
        "image": "/images/spag-bol.jpg", 
        "difficulty": "Easy", 
        "ingredients": "2 cloves of garlic|1 onion|2 sprigs of fresh rosemary|6 rashers dry-cured higher-welfare smoked streaky bacon|olive oil|500 g minced beef|200 ml red wine|1 x 280 g jar of sun-dried tomatoes|2 x 400 g tins of plum tomatoes|500 g dried spaghetti|Parmesan cheese|extra virgin olive oil", 
        "method": "Preheat the oven to 180ºC/350ºF/gas 4.|Peel and finely chop the garlic and onions, pick and finely chop the rosemary, then finely slice the bacon.|Heat a splash of oil in a casserole pan on a medium heat, add the bacon, rosemary, garlic and onion and cook for 5 minutes, or until softened, stirring occasionally.|Add the minced beef, breaking it apart with the back of a spoon, then cook for 2 to 3 minutes, or until starting to brown, then pour in the wine. Leave to bubble and cook away.|Meanwhile, drain and tip the sun-dried tomatoes into a food processor, blitz to a paste, then add to the pan with the tomatoes. Stir well, break the plum tomatoes apart a little.|Cover with a lid then place in the oven for 1 hour, removing the lid and giving it a stir after 30 minutes – if it looks a little dry at this stage, add a splash of water to help it along.|About 10 minutes before the time is up, cook the spaghetti in boiling salted water according to the packet instructions.|Once the spaghetti is cooked, drain, reserving a mugful of cooking water, then return to the pan with a few spoons of Bolognese, a good grating of Parmesan and a drizzle of extra virgin olive oil.|Toss to coat the spaghetti, loosening with a splash of cooking water, if needed.|Divide the spaghetti between plates or bowls, add a good spoonful of Bolognese to each, then serve with a fine grating of Parmesan.", 
        "tags": "Classic|Dinner|Main|Comfort Food",
        "likes": "57" 
    },
    { 
        "title": "Beef Stew",
        "author": "Viola Harrison", 
        "serves": "8", 
        "cookingTimeHrs": 6,
        "cookingTimeMins": 0,
        "image": "/images/beef-stew.jpg", 
        "difficulty": "Easy", 
        "ingredients": "2.5 kg oxtail, chopped into 4cm chunks (ask your butcher to do this)|olive oil|2 medium leeks|2 sticks of celery|4 medium carrots|a few sprigs of fresh thyme|a few sprigs of fresh rosemary|4 fresh bay leaves|4 cloves|2 heaped tablespoons plain flour|2 x 400 g tins of plum tomatoes|275 ml porter or red wine|1 litre organic beef stock , optional|Worcestershire sauce", 
        "method": "Preheat the oven to 220ºC/425ºF/gas 7. Place a large roasting tray in the oven to preheat.|Carefully remove the hot tray from the oven, then add the oxtail. Season and drizzle over a lug of olive oil, then toss to coat and place in the hot oven for around 20 minutes, or until golden and caramelized.|Meanwhile, trim and halve the leeks and celery lengthways, then chop into rough 2cm chunks. Peel and chop the carrots into 2cm pieces, then place into a large ovenproof casserole pan over a medium-low heat with 1 tablespoon of olive oil.|Pick, roughly chop and add the thyme and rosemary leaves, then add the bay and cook for around 20 minutes, or until soft and sweet, stirring frequently.|Meanwhile, remove the oxtail from the oven and set aside. Reduce the oven temperature to 170ºC/325ºF/gas 3.|Add the cloves and flour to the veg, stirring well to combine, then pour in the tomatoes and porter (or wine, if using). Add the oxtail and any roasting juices, cover with the beef stock or 1 litre of cold water and stir well.|Turn the heat up to high and bring to the boil, then pop the lid on and place in the hot oven for around 5 hours, or until the meat falls away from the bone, stirring every hour or so and adding a splash of water to loosen, if needed.|Remove the pan from the oven and leave to cool for about 10 minutes. Using rubber gloves, strip the meat from the bones and return to the pan, discarding the bones.|Add a good splash of Worcestershire sauce, season to taste and enjoy with creamy mash and seasonal steamed greens.", 
        "tags": "Dinner|Main|Famliy|Beef",
        "likes": "28" 
    },
    { 
        "title": "Fancy Meatloaf",
        "author": "Hunter Walsh", 
        "serves": "12", 
        "cookingTimeHrs": 2,
        "cookingTimeMins": 0,
        "image": "/images/meatloaf.jpg", 
        "difficulty": "Medium", 
        "ingredients": "4 medium bulbs of fennel|olive oil|2 onions|2 carrots|½ a bunch of fresh sage (15g)|½ a bunch of fresh rosemary (15g)|1 x 125 g ball of mozzarella cheese|200 g sourdough breadcrumbs|1 kg higher-welfare minced pork|1 kg minced beef|2 teaspoons wholegrain mustard|2 large free-range eggs|12 rashers of higher-welfare smoked streaky bacon|500 ml organic chicken stock|2 tablespoons quality blackcurrant jam|1 tablespoon sun-dried tomato purée", 
        "method": "Preheat the oven to 180ºC/350ºF/gas 4.|Trim each fennel bulb and chop into eight wedges, then place in a large roasting tray, drizzle with oil, season with sea salt and black pepper and roast for 30 minutes.|Meanwhile, peel and dice the onions and carrots, place in a large pan with 1 tablespoon of oil on a medium-low heat and cook for 20 minutes, stirring occasionally.|Pick the herb leaves, finely chop half of them and add to the veg pan, saving the rest for later.|Leave the veg to cool completely, then tear in the mozzarella and add the breadcrumbs, minced meat, mustard, eggs, and a good pinch of sea salt and black pepper. Scrunch and mix well, then shape into a loaf.|Make a space in the middle of the fennel tray and sit the meatloaf in the centre. Criss-cross the smoky bacon over the meatloaf, drizzle with a little oil, then cover the tray with tin foil.|Roast for 30 minutes, then remove from the oven and discard the foil.|Mix the chicken stock, jam and tomato purée together in a jug until smooth, then pour into the tray. Toss the reserved herbs with a little oil and scatter into the tray, then return to the oven for a final 45 minutes, or until cooked through.|If the juices need thickening at this stage, simply put the tray on the hob to reduce for a few minutes, until they’re the consistency of your liking, skimming away any fat from the surface, if needed.|Serve the meatloaf, sweet fennel and juices with mash and seasonal greens.", 
        "tags": "Main|Classic|Dinner|Famliy|Beef",
        "likes": "235" 
    },
    { 
        "title": "Chai Spiced Carrot Cake",
        "author": "Claire Daniels", 
        "serves": "10", 
        "cookingTimeHrs": 1,
        "cookingTimeMins": 20,
        "image": "/images/carrot-cake.jpg", 
        "difficulty": "Very Easy", 
        "ingredients": "250 ml vegetable oil, plus extra for greasing|4 large carrots|1 large lemon|100 g currants , or sultanas|100 g pecans|280 g plain flour|2 teaspoons baking powder|1 tablespoon ground ginger|1 tablespoon ground cinnamon|2 teaspoons ground cardamom|¼ teaspoon ground cloves|¼ teaspoon ground anise|¼ teaspoon ground nutmeg|4 tablespoons candied ginger in syrup|1 black tea bag|2 large free-range eggs|200 g caster sugar|200 g light brown sugar|30 g flaked coconut|BUTTERCREAM|200 g unsalted butter, (at room temperature)|200 g cream cheese|125 g icing sugar", 
        "method": "Preheat the oven to 180ºC/350ºF/gas 4. Grease and line a 20cm x 30cm traybake tin.|Peel and grate the carrots into a large bowl, then grate in the lemon zest. Mix in the currants, then roughly chop and add the pecans.|In another bowl, combine the flour, baking powder, all the spices and ½ a teaspoon of sea salt. Dice and add the ginger, then split open the tea bag, pour in the leaves, and mix well.|Whisk the eggs in a mixing jug, then mix in both sugars and the vegetable oil. Pour over the carrots, give it a good stir, then add the dry ingredients and mix until just combined.|Pour the batter into the pan and bake in the oven for 55 minutes, or until a skewer inserted into the centre comes out clean.|Allow to cool in the tin for 15 minutes, then remove from the tin and invert onto a wire rack to cool completely.|Meanwhile, for the buttercream, place the butter in the bowl of a free-standing mixer and beat for about 5 minutes, or until creamy.|Add the cream cheese and beat until just combined. Next, add the icing sugar and beat again until smooth – don’t overmix it, or your icing will be runny! Chill in the fridge for at least 15 minutes, then spoon over the cake and spread out evenly.|Toast the coconut in a dry frying pan over a medium heat for 3 minutes, or until lightly golden, tossing occasionally. Scatter over the iced cake, then slice up and enjoy!", 
        "tags": "Dessert|Cake",
        "likes": "34" 
    },
    { 
        "title": "Salted Caramel Brownies",
        "author": "Joanna Schuman", 
        "serves": "16", 
        "cookingTimeHrs": 0,
        "cookingTimeMins": 55,
        "image": "/images/brownies.jpg", 
        "difficulty": "Medium", 
        "ingredients": "225 g butter , plus extra for greasing|250 g dark chocolate (70% cocoa solids)|225 g golden caster sugar|4 large free-range eggs|150 g plain flour|¼ of a vanilla pod|40 ml double cream|15 g salted butter|60 g caster sugar|40 g golden syrup", 
        "method": "Start by making your caramel. Split the vanilla pod lengthways, scrape out the seeds, then place into a pan.|Combine with the cream, half of the butter and a good pinch of sea salt. Cook, whisking, over a low heat for about 2 to 3 minutes until it’s just bubbling, then take the pan off the heat and set aside.|Place the caster sugar and golden syrup in a medium heavy-based pan over a low heat. Don’t stir, just gently swirl the pan to help dissolve the sugar.|Turn up the heat to medium and keep swirling until the sugar turns into a golden caramel.|Take the pan off the heat. Discard the vanilla pod from the hot milk, then stir in the caramel with a wooden spoon.|Return it to a low heat while you stir in the remaining butter, then remove from the heat and set aside.|Scrunch up a large piece of greaseproof paper, make it wet (shake off the excess), then use it to line a 20cm x 30cm baking tin.|Pour in the caramel, sprinkle with another pinch of salt, and place it on a tea towel in the fridge for 30 minutes, until you have a thick, gooey caramel.|Once the caramel has been chilling for 15 minutes, start the brownies. Preheat the oven to 180ºC/350ºF/gas 4. Grease and line another 20cm x 30cm baking tin.|Melt the butter in a pan over a low heat. Chop and stir in the chocolate until it’s melted, then remove from the heat and stir in the sugar.|Once cooled slightly, whisk in the eggs, then sift and fold in the flour until incorporated. Pour the mixture into the tin.|Take your caramel from the fridge, scoop out spoonfuls and dot them into the brownie mixture, pressing to submerge. Once you have a third of the caramel left, drizzle it on top, using your spoon to ripple it through.|Bake the brownies in the oven for about 25 minutes, or until cooked but still a bit gooey.|Leave to cool for 1 hour, cut into squares and serve.", 
        "tags": "Dessert|Slice|Chocolate",
        "likes": "212" 
    },
    { 
        "title": "Gluten-Free Lemon Cake",
        "author": "Joanna Schuman", 
        "serves": "12", 
        "cookingTimeHrs": 1,
        "cookingTimeMins": 10,
        "image": "/images/lemon-cake.jpg", 
        "difficulty": "Very Easy", 
        "ingredients": "300g dairy-free margarine (suitable for baking, at room temperature)|300 g gluten-free plain flour , plus extra for dusting|300 g golden caster sugar|4 large free-range eggs|3 lemons|2 oranges|2 teaspoons gluten-free baking powder|½ teaspoon xanthan gum|100 g icing sugar", 
        "method": "Preheat the oven to 180ºC/350ºF/gas 4. Grease a 20cm square cake tin with the margarine, then line the bottom with greaseproof paper and dust the sides with gluten-free flour.|In a bowl, beat the margarine and sugar for around 5 minutes, or until light and fluffy.|Crack in the eggs, finely grate and add the zest from 2 lemons and 1 orange, then mix to combine.|Sieve the flour, baking powder and xanthan gum into the bowl, then fold through. Stir in the juice from 1 lemon and ½ an orange until you have a nice, smooth mixture.|Pour the mixture into the cake tin, smooth out to the edges, then place on the middle shelf of the hot oven for 35 minutes, or until golden and an inserted skewer comes out clean.|Leave to cool for 5 minutes, before turning the cake out onto a wire cooling rack, then leave to cool completely while you make the icing.|Combine the icing sugar with the zest and juice from ½ a lemon and ¼ of an orange. Once the cake has cooled, drizzle the icing on top, grate over a little lemon and orange zest, then serve.", 
        "tags": "Dessert|Cake|Gluten-free",
        "likes": "12" 
    },
    { 
        "title": "Sticky Toffee Pudding",
        "author": "Joanna Schuman", 
        "serves": "16", 
        "cookingTimeHrs": 1,
        "cookingTimeMins": 15,
        "image": "/images/toffee-pudding.jpg", 
        "difficulty": "Medium", 
        "ingredients": "2 Earl Grey tea bags|200g fresh Medjool dates|1 level teaspoon ground cinnamon|1 level teaspoon ground ginger|1 whole nutmeg , for grating|250 g leftover cooked pumpkin or butternut squash|170 g unsalted butter , plus extra for greasing (at room temperature)|340 g self-raising flour , plus extra for dusting|170 g golden caster sugar|170 g dark muscovado sugar|4 large free-range eggs|Maldon sea salt|CARAMEL SAUCE|250 g unsalted butter|125 g dark muscovado sugar|125 g golden caster sugar|50 ml dark rum|300 ml double cream", 
        "method": "Preheat the oven to 180°C/350°F/gas 4.|Put the tea bags into a jug, cover with 150ml of boiling water and leave to steep for 3½ minutes. Meanwhile, destone the dates and put into a food processor with the cinnamon and ginger, then finely grate in half the nutmeg. Scoop out the tea bags and pour the tea over the dates, pushing them down so they’re submerged. Leave them to soak with the lid on for 10 minutes. Add the roasted pumpkin or squash, then blitz to a purée, stopping occasionally to scrape down the sides, which will help it along.|Butter and lightly flour a 26cm Bundt tin or a 20cm x 30cm baking dish. In a large mixing bowl, cream the butter and sugars together using a wooden spoon. Beat in the eggs, one by one then, using a large metal spoon, stir in the flour and fold in the puréed dates. Pour the pudding mixture into your chosen receptacle, then bake for 45 to 50 minutes, or until an inserted skewer comes out clean.|When your pudding is almost ready, make the sauce. Cube the butter and melt in a small pan on a medium heat. Add both the sugars, then, once nicely mixed, carefully add the rum (it may splatter) and double cream. Bring to the boil, then simmer for around 5 minutes, or until a lovely deep golden colour.|As soon as the pudding is out of the oven, if using a Bundt tin, flip out onto a platter and brush all over with enough sauce to form a delicate, crispy surface but also keep your sponge nice and bouncy. Or, if you’re traybaking it in a dish, poke small holes in the top and pour over one-third of the sauce. Sprinkle with a little sea salt for contrast, and serve with the remaining sauce on the side (or save for another day) and a little double cream, Greek yoghurt, ice cream or custard, if you like.", 
        "tags": "Dessert|Pudding|Classic",
        "likes": "42" 
    },
    { 
        "title": "Leek & Salmon Parcels",
        "author": "Laura Mendez", 
        "serves": "4", 
        "cookingTimeHrs": 0,
        "cookingTimeMins": 40,
        "image": "/images/salmon-parcels.jpg", 
        "difficulty": "Easy", 
        "ingredients": "50g unsalted butter|2 medium leeks|4 salmon fillets , skin off, scaled, pin-boned, from sustainable sources|8 tablespoons dry vermouth , or dry white wine|4 tablespoons organic chicken stock|1 tablespoon baby capers|a few sprigs of fresh dill", 
        "method": "Preheat the oven to 200ºC/400ºF/gas 6.|Melt the butter in a non-stick frying pan over a medium heat. Cut out four 40cm squares of greaseproof paper and brush with a little melted butter. Trim the leeks, then julienne or cut into matchsticks and sauté in the butter for 6 to 8 minutes, or until lightly golden. Season well.|Divide half of the leeks between the paper. Place a salmon fillet on each, season, and spoon over 2 tablespoons of vermouth, 1 tablespoon of stock and the remaining leeks. Scatter over the capers. Finely chop and scatter over the dill. Fold up the sides of the paper and scrunch up to make secure parcels.|Place the parcels on a baking sheet and cook for 15 minutes, or until the salmon is cooked. Open the parcels at the table.", 
        "tags": "Dinner|Lunch|Healthy|Gluten-free",
        "likes": "17" 
    },
    { 
        "title": "Tasty Warm Lentil Salad",
        "author": "Phil Ramos", 
        "serves": "4", 
        "cookingTimeHrs": 0,
        "cookingTimeMins": 15,
        "image": "/images/lentil-salad.jpg", 
        "difficulty": "Very Easy", 
        "ingredients": "1 x 50 g tin of anchovies in oil, from sustainable sources|1 preserved lemon (20g)|400 g tenderstem broccoli|1-2 fresh mixed-colour chillies|2 x 250 g packets of cooked lentils", 
        "method": "Put all the anchovies and their oil into a blender with 1 tablespoon of liquor from the preserved lemon jar and a splash of water. Blitz until smooth, loosening with a little more water, if needed.|Trim the broccoli and blanch in a large pan of boiling salted water for 3 minutes, or until just tender, while you quarter the preserved lemon and trim away the seedy core, then finely chop the rind. Finely slice the chillies.|Drain the broccoli, return to the pan over the heat and toss with the lemon, most of the chilli and 1 tablespoon of extra virgin olive oil. Add the lentils and toss for 2 minutes, then divide between plates, drizzle over the anchovy dressing and scatter with the reserved chilli. Finish with ½ a tablespoon of extra virgin olive oil.", 
        "tags": "Salad|Lunch|Healthy|Gluten-free",
        "likes": "9" 
    },
    { 
        "title": "Chicken Laksa",
        "author": "Vergil Spencer", 
        "serves": "4", 
        "cookingTimeHrs": 1,
        "cookingTimeMins": 15,
        "image": "/images/laksa.jpg", 
        "difficulty": "Easy", 
        "ingredients": "4 chicken thighs , skin off, bone out|1 heaped teaspoon Chinese five-spice powder|1 tablespoon runny honey|1 tablespoon sesame seeds|1 fresh red chilli|1 organic chicken or vegetable stock cube|1 butternut squash , (neck end only)|2 cloves of garlic|5 cm piece of ginger|1 fresh red chilli|1 teaspoon ground turmeric|½ a bunch spring onions|1 heaped teaspoon peanut butter|4 dried lime leaves|½ a bunch of fresh coriander|1 tablespoon sesame oil|1 tablespoon low-salt soy sauce|1 tablespoon fish sauce|300 g medium rice noodles|2 bunches of asparagus , (600g)|1 x 400 g tin of light coconut milk|3 limes", 
        "method": "On a large sheet of greaseproof paper, toss the chicken with sea salt, black pepper and the five-spice.   |Fold over the paper, then bash and flatten the chicken to 1.5cm thick  with a rolling pin. |Place on the hot griddle pan, turning after 3 or 4  minutes, until nicely charred and cooked through. |Pour about 800ml of boiling water into the large pan and crumble in the stock cube.  |Trim the stalk off the squash, roughly chop the neck end (don’t peel,  and keep the seed end for another day), then grate and tip into the  boiling stock.  Peel the garlic and ginger. |Swap to the bowl blade in the processor and  add the garlic, ginger, chilli, turmeric, trimmed spring onions, peanut  butter, lime leaves, coriander stalks (reserving the leaves), sesame  oil, soy and fish sauces. Blitz to a paste, then tip into the stock and  add the noodles.  |Trim the asparagus and cut in half. Add to the pan, pour in the coconut  milk, and as soon as it boils, taste, correct the seasoning with soy  sauce and lime juice, then turn the heat off.  |Drizzle the honey over the charred chicken, squeeze over the juice of 1 lime, scatter with the sesame seeds and toss to coat.  |Serve with the laksa and lime wedges, sprinkling everything with the coriander leaves and slices of fresh chilli.", 
        "tags": "Dinner|Main|Spicy",
        "likes": "22" 
    },
    { 
        "title": "Super Food Noodle Salad",
        "author": "Winston Pearce", 
        "serves": "4", 
        "cookingTimeHrs": 0,
        "cookingTimeMins": 25,
        "image": "/images/super-salad.jpg", 
        "difficulty": "Easy", 
        "ingredients": "200 g rice noodles|1 small broccoli|1 handful frozen peas|1 handful frozen edamame beans|1 tablespoon sesame seeds|1 bunch of spring onions|½ a bunch of fresh mint|SESAME DRESSING|3 cm piece of ginger|1 fresh red chilli|2 limes|3 tablespoons olive oil|1 tablespoon sesame oil|1 tablespoon low-salt soy sauce|½ teaspoon brown sugar", 
        "method": "Prepare the noodles according to the packet instructions.|Bring a pan of water to the boil. Cut the broccoli into florets and add to the boiling water for 2 minutes.|Add the peas and edamame beans to the water, bring back to boil, then rinse, drain and refresh under cold water.|Toast the sesame seeds in a dry frying pan over a medium heat. Trim and finely slice the spring onions. Pick and chop the mint leaves.|To make the dressing, peel and finely chop the ginger, then deseed and finely slice the chilli. Place into a jar with a tight-fitting lid.|Finely grate in the zest from 1 lime, squeeze in about 4 tablespoons of lime juice, then add the remaining dressing ingredients. Shake well.|Combine the noodles, green vegetables and spring onions, then mix in the dressing, chopped mint and toasted sesame seeds.", 
        "tags": "Lunch|Healthy|Gluten-free|Spicy",
        "likes": "15" 
    }
    
]   